---
kind: property
id: P:Autodesk.Revit.DB.LayoutRuleClearSpacing.JustifyType
source: html/4b726f3c-9c30-1c01-74cd-0b42512fe7b8.htm
---
# Autodesk.Revit.DB.LayoutRuleClearSpacing.JustifyType Property

Get or set the type of justification.

## Syntax (C#)
```csharp
public BeamSystemJustifyType JustifyType { get; set; }
```

## Remarks
The justifyType passed in must be a valid object.